package com.appstudio.android.sample.ch_19;

public final class HandSetList {
   
    public static final String[] TITLES = 
    {
            "갤럭시 노트",   
            "프라다 3.0",
            "베가 LTE",       
            "모토로라 레이저",
            "테이크 HD",
            "갤럭시 넥서스",  
            "옵티머스 LTE",
            "베가 넘버5"
    };
    
    public static final String[] DIALOGUE = 
    {
            "모델명 SHV-E160 S/K/L인 이 제품의 이름은 바로 갤럭시 노트다. 이미 지난 9월 베를린에서 있었던 IFA2011에서 공개되어 전세계의 주목을 받았으며 국내에서는 LTE통신망을 채택하여 빠른 데이터 처리능력을 보여준다. S펜을 이용해 다양하고 감각적인 다이어리로 변신 가능하다.",
            
            "프라다 3.0은 안드로이드 2.3(Gingerbread)를 기반으로 제작된 스마트폰이며, LG전자에서는 추후 안드로이드 4.0(Icecream Sandwich)를 제공할 예정이라고 한다. 프라다 3.0은 프라다(PRADA)만의 고유한 디자인을 가지고 있으며, 800니트(nit) 밝기의 디스플레이를 탑재하여 밝고 선명한 화면을 보여준다.",

            "베가 LTE는 세계 최초로 모션 인식 기능을 추가하여,  손동작을 통해 조작을 하는 것이 가능하다. 전화, 음악, E-Book 어플리케이션에서 사용이 가능하며, 화면 앞에서 손을 흔들거나 멈추면, 전면 카메라가 동작을 인식하여, 스피커 통화를 가능하게 하거나, 음악 재생/일시정지, 이전곡/다음곡 재생, 페이지 넘기기와 같은 조작이 가능하다.",
            
            "7.1mm의 슬림한 두께와 긁힘에 강한 케블라 소재, 골리라 글래스 채용, 물 튀김 방수 코팅, 모토 캐스트, 랩 독 등 아트릭스보다 더 강력한 다양함을 보여준다. 국외에서 출시된 지 한 달여 만에 국내로 출시되는 점과 구글과의 인수합병 이슈로 주목받고 있는 모토로라 레이저를 알아보자",
            
            "테이크HD는 1280X800의 해상도와 1.5GHZ 듀얼코어CPU를 탑재한 3G스마트 폰으로, 작년 9월 IFA2011에서 일명 ‘스파이더폰’으로 유명세를 탔다. 당시에는 랩탑과 연결하면 넷북처럼 사용 가능했고, 태블릿과 결합하면 10.1인치의 태블릿으로 변신했으며, 블루투스 게임킷과 연동되어 다양한 게임을 이용 할 수 있었다. ",
            
            "2011년 10월 19일 홍콩에서는 구글 안드로이드의 3번째 레퍼런스 폰인 GALAXY NEXUS(이하 갤럭시 넥서스)이 발표되었다. 이번 갤럭시 넥서스는 스마트폰과 태블릿에서 적용할 수 있는 Android 4.0 (Ice Cream Sandwich)이 최초로 탑재되었다는 점에서 더욱 주목을 받았다.",
            
            "옵티머스 LTE는 애칭에서도 알 수 있듯이 LTE를 기본으로 지원한다. 또한 LG전자에서 강조하고 있는 NOVA 디스플레이 보다 넓은 시야각과 선명한 화면을 자랑하는 4.5인치 대화면 IPS True HD 디스플레이, DDR2 1GB의 메모리, Full HD 동영상 녹화 및 재생, DLNA, Wi-Fi Direct 등 디스플레이와 각종 멀티미디어 기능에 좀 더 무게를 실은 제품이다",

            "팬택은 스카이 최초의 듀얼코어 안드로이드 폰인 베가 레이서를 공개하였다. 당시 제품발표회 한 켠에 공개되었던 Vega No.5는 팬택의 5번째 베가 시리즈인 동시에 5인치 디스플레이를 가진 제품으로 소개되었는데, Vega No.5는 1.5GHz 듀얼코어 CPU와 DDR2 1GB RAM을 탑재하여, 사용자에게 네비게이션이 되기도 하며 전자사전이기도 하고 E-Book 기능을 가질 수 있으며, 모바일 오피스기능과 DLNA등을 지원한다."
    };
}
